/* Underlying error message suffix */
" (Underlying error: %@" = " (Underlying error: %@";

/* Error message context format */
" when %@" = " when %@";

/* AirDirect unsupported text */
"%$1@ is not supported in this App. You can connect %1$@ AirTurns in modes 2-6" = "%$1@ is not supported in this App. You can connect %1$@ AirTurns in modes 2-6";

/* Pairing methods description */
"%@.\nIn Open method, pairing is only required in modes 2+ and the AirTurn can pair to up to 8 devices.\nIn Closed method, pairing is required in all modes, and pairing can only be made with one device." = "%@.\nIn Open method, pairing is only required in modes 2+ and the AirTurn can pair to up to 8 devices.\nIn Closed method, pairing is required in all modes, and pairing can only be made with one device.";

/* Contact support error message suffix */
". If the problem continues to occur, contact AirTurn support" = ". If the problem continues to occur, contact AirTurn support";

/* Try again error message suffix */
". Try again" = ". Try again";

/* 0 key pressed */
"0" = "0";

/* 1 key pressed */
"1" = "1";

/* Time interval before automatic power off - 1 hour */
"1 hour" = "1 hour";

/* Time interval before automatic power off - 15 min */
"15 minutes" = "15 minutes";

/* 2 key pressed */
"2" = "2";

/* Time interval before automatic power off - 2 hours */
"2 hours" = "2 hours";

/* 3 key pressed */
"3" = "3";

/* 4 key pressed */
"4" = "4";

/* 5 key pressed */
"5" = "5";

/* Time interval before automatic power off - 5 hours */
"5 hours" = "5 hours";

/* Time interval before automatic power off - 5 min */
"5 minutes" = "5 minutes";

/* 6 key pressed */
"6" = "6";

/* 7 key pressed */
"7" = "7";

/* 8 key pressed */
"8" = "8";

/* 9 key pressed */
"9" = "9";

/* A key pressed */
"A" = "A";

/* Update available message */
"A device update is available for the connected AirTurn \"%@\". You can update your AirTurn to get the latest features and fixes in the AirTurn App" = "A device update is available for the connected AirTurn \"%@\". You can update your AirTurn to get the latest features and fixes in the AirTurn App";

/* Charging fault error message */
"A fault occurred while charging. Disconnect the power supply and reconnect. If the issue persists, contact AirTurn support" = "A fault occurred while charging. Disconnect the power supply and reconnect. If the issue persists, contact AirTurn support";

/* Advanced settings nav title
   Advanced table view cell */
"Advanced" = "Advanced";

/* Info for removing pairing */
"After it has restarted, power on and reconnect" = "After it has restarted, power on and reconnect";

/* Product name */
"AirTurn" = "AirTurn";

/* AirTurn no toggle enabled message */
"AirTurn BT-105 support is enabled" = "AirTurn BT-105 support is enabled";

/* AirTurn connection mode section heading */
"AirTurn Connection Mode" = "AirTurn Connection Mode";

/* AirTurn is not available on your device message */
"AirTurn is not available on your device" = "AirTurn is not available on your device";

/* PED unsupported text */
"AirTurn PED is not supported on this device" = "AirTurn PED is not supported on this device";

/* AirTurn pre-connect pairing warning message */
"AirTurn requires pairing to operate.  If prompted, please tap \"Pair\"" = "AirTurn requires pairing to operate.  If prompted, please tap \"Pair\"";

/* Text to display next to the enable AirTurn switch */
"AirTurn Support" = "AirTurn Support";

/* AirTurn update alert title */
"AirTurn Update Found" = "AirTurn Update Found";

/* AirTurn already bonded title */
"Already bonded" = "Already bonded";

/* Fetching feed update error message */
"An error occurred fetching the feed" = "An error occurred fetching the feed";

/* Extracting update update error message */
"An error occurred while extracting the update" = "An error occurred while extracting the update";

/* Fetching update update error message */
"An error occurred while fetching the update" = "An error occurred while fetching the update";

/* Parsing feed update error message */
"An error occurred while parsing the feed" = "An error occurred while parsing the feed";

/* Parsing update update error message */
"An error occurred while parsing the update" = "An error occurred while parsing the update";

/* Verifying firmware update error message */
"An error occurred while verifying the firmware" = "An error occurred while verifying the firmware";

/* Verifying update update error message */
"An error occurred while verifying the update" = "An error occurred while verifying the update";

/* Unknown error message */
"An unknown error occurred. If this keeps happening, try updating the App or contact support. (%@)" = "An unknown error occurred. If this keeps happening, try updating the App or contact support. (%@)";

/* Already updating peripheral update error message */
"An update is already in progress" = "An update is already in progress";

/* Update not supported error message */
"An update is available but it cannot be performed by this version of the App. Update the App and try again" = "An update is available but it cannot be performed by this version of the App. Update the App and try again";

/* AirTurn update alert message */
"An update is available for %@" = "An update is available for %@";

/* Analog table view cell */
"Analog" = "Analog";

/* App Store button title */
"App Store" = "App Store";

/* Switch to closed when not paired warning message */
"As this AirTurn is not paired and you are switching to Closed method, pairing will be required. When prompted, tap \"Pair\"" = "As this AirTurn is not paired and you are switching to Closed method, pairing will be required. When prompted, tap \"Pair\"";

/* String to toggle the key repeat */
"Auto-repeat" = "Auto-repeat";

/* B key pressed */
"B" = "B";

/* Backslash key pressed */
"Backslash" = "Backslash";

/* Beta update button title */
"Beta Update" = "Beta Update";

/* Beta update confirm title */
"Beta Update Confirm" = "Beta Update Confirm";

/* Bluetooth powered off message */
"Bluetooth is powered off, enable in iOS Settings" = "Bluetooth is powered off, enable in iOS Settings";

/* Connection speed description */
"By default, AirTurn reduces its connection speed to conserve battery power. Alternatively you can increase the connection speed so pedal presses are more responsive" = "By default, AirTurn reduces its connection speed to conserve battery power. Alternatively you can increase the connection speed so pedal presses are more responsive";

/* Key repeat mode description */
"By default, AirTurn uses your configured key repeat settings in modes 2+. Alternatively you can use the key repeat settings configured on the Operating System (which will also disable key repeat for mode 1)." = "By default, AirTurn uses your configured key repeat settings in modes 2+. Alternatively you can use the key repeat settings configured on the Operating System (which will also disable key repeat for mode 1).";

/* C key pressed */
"C" = "C";

/* Writing analog calibrate context */
"calibrating the analog pedal" = "calibrating the analog pedal";

/* Writing analog set raw context */
"calibrating the analog pedal as raw output" = "calibrating the analog pedal as raw output";

/* Cancel alert button
   Cancel button title */
"Cancel" = "Cancel";

/* Charging fault alert title */
"Charging fault" = "Charging fault";

/* No comment provided by engineer. */
"Check for Updates" = "Check for Updates";

/* Checking update label */
"Checking" = "Checking";

/* Checking for updates context */
"checking for updates" = "checking for updates";

/* Closed method alert title
   Closed method setting cell */
"Closed method" = "Closed method";

/* Comma key pressed */
"Comma" = "Comma";

/* Text to display next to a connected device */
"Connected" = "Connected";

/* Connecting context */
"connecting" = "connecting";

/* Connection speed section heading */
"Connection speed" = "Connection speed";

/* connection timed out central error message
   Connection timed out peripheral error message */
"Connection timed out" = "Connection timed out";

/* Connection timed out message */
"Connection to the AirTurn timed out.  Please check the device is on and in range.  Otherwise please try forgetting the device from iOS Bluetooth settings" = "Connection to the AirTurn timed out.  Please check the device is on and in range.  Otherwise please try forgetting the device from iOS Bluetooth settings";

/* Beta update confirm continue
   Continue alert button
   Debug update confirm continue */
"Continue" = "Continue";

/* Could not read file peripheral update error message */
"Could not read the update file" = "Could not read the update file";

/* current pairing method closed footer text */
"Currently in Closed method with one pairing to this %@" = "Currently in Closed method with one pairing to this %@";

/* current pairing method open not paired no pairings footer text */
"Currently in Open method, not paired to any devices" = "Currently in Open method, not paired to any devices";

/* current pairing method open not paired multiple pairings footer text */
"Currently in Open method, not paired to this %@, with %d other pairings" = "Currently in Open method, not paired to this %1$@, with %2$d other pairings";

/* current pairing method open not paired singular pairing footer text */
"Currently in Open method, not paired to this %@, with one other pairing" = "Currently in Open method, not paired to this %@, with one other pairing";

/* current pairing method open not paired no pairings footer text */
"Currently in Open method, paired only to this %@" = "Currently in Open method, paired only to this %@";

/* current pairing method open paired multiple pairings footer text */
"Currently in Open method, paired to this %@, with %d other pairings" = "Currently in Open method, paired to this %1$@, with %2$d other pairings";

/* current pairing method open paired singular pairing footer text */
"Currently in Open method, paired to this %@, with one other pairing" = "Currently in Open method, paired to this %@, with one other pairing";

/* D key pressed */
"D" = "D";

/* Debounce time title */
"Debounce time" = "Debounce time";

/* Debug update button title */
"Debug Update" = "Debug Update";

/* Debug update confirm title */
"Debug Update Confirm" = "Debug Update Confirm";

/* Description of debounce time property */
"Defines the time during which only one input event can occur. If you are experiencing multiple outputs being sent, try increasing this value. If your AirTurn is not responsive enough, try decreasing this value." = "Defines the time during which only one input event can occur. If you are experiencing multiple outputs being sent, try increasing this value. If your AirTurn is not responsive enough, try decreasing this value.";

/* No comment provided by engineer. */
"Delay before repeat" = "Delay before repeat";

/* Delete key pressed */
"Delete" = "Delete";

/* Device name section heading */
"Device name" = "Device name";

/* The text in the heading above the list of devices */
"DEVICES" = "DEVICES";

/* Disable update checking button title */
"Disable version checking" = "Disable version checking";

/* Discovery timed out peripheral error message */
"Discovery timed out" = "Discovery timed out";

/* Dismiss button title
   Error dismiss button */
"Dismiss" = "Dismiss";

/* Download and update cell label */
"Download and Update" = "Download and Update";

/* Downloading update label */
"Downloading" = "Downloading";

/* E key pressed */
"E" = "E";

/* Enable update checking button title */
"Enable version checking" = "Enable version checking";

/* Writing analog enable context */
"enabling the analog pedal" = "enabling the analog pedal";

/* Equal key pressed */
"Equal" = "Equal";

/* Error occurred cell text */
"Error occurred" = "Error occurred";

/* Characteristic discovery peripheral error message */
"Error while connecting to the device: Characteristic discovery" = "Error while connecting to the device: Characteristic discovery";

/* Invalid data peripheral error message */
"Error while connecting to the device: Invalid data read" = "Error while connecting to the device: Invalid data read";

/* Missing characteristics peripheral error message */
"Error while connecting to the device: Missing characteristics" = "Error while connecting to the device: Missing characteristics";

/* Missing services peripheral error message */
"Error while connecting to the device: Missing services" = "Error while connecting to the device: Missing services";

/* Service discovery peripheral error message */
"Error while connecting to the device: Service discovery" = "Error while connecting to the device: Service discovery";

/* Write control peripheral update error message */
"Error writing update control" = "Error writing update control";

/* Default error title */
"Error!" = "Error!";

/* F key pressed */
"F" = "F";

/* Fast response setting cell */
"Fast response" = "Fast response";

/* Fetching update context */
"fetching update" = "fetching update";

/* Text to display on automatic keyboard management cell */
"Force Keyboard" = "Force Keyboard";

/* No comment provided by engineer. */
"Forget AirTurn" = "Forget AirTurn";

/* Forget footer text */
"Forgetting an AirTurn stops the App automatically connecting" = "Forgetting an AirTurn stops the App automatically connecting";

/* Forward Delete key pressed */
"Forward Delete" = "Forward Delete";

/* G key pressed */
"G" = "G";

/* Update available go to App dismiss button */
"Go to App" = "Go to App";

/* Grave key pressed */
"Grave" = "Grave";

/* H key pressed */
"H" = "H";

/* I key pressed */
"I" = "I";

/* Automatic keyboard managment toggle description */
"If on, the virtual keyboard will be forced on screen when a text box is active and a BT-105 or external keyboard is connected" = "If on, the virtual keyboard will be forced on screen when a text box is active and a BT-105 or external keyboard is connected";

/* Warning for current firmware without service changed characteristic the user will need to toggle bluetooth */
"IMPORTANT: This time only, you will also need to toggle Bluetooth off and on in iOS settings. You will not need to do this for future updates." = "IMPORTANT: This time only, you will also need to toggle Bluetooth off and on in iOS settings. You will not need to do this for future updates.";

/* Write too large peripheral error message */
"Internal error: attribute write too large" = "Internal error: attribute write too large";

/* Invalid command peripheral update error message */
"Internal error: invalid update command written" = "Internal error: invalid update command written";

/* Attribute write failed peripheral error message */
"Internal error: write failed" = "Internal error: write failed";

/* iOS settings alert button */
"iOS Settings" = "iOS Settings";

/* J key pressed */
"J" = "J";

/* K key pressed */
"K" = "K";

/* Key repeat mode section heading */
"Key repeat mode" = "Key repeat mode";

/* KP Multiply key pressed */
"KP Multiply" = "KP Multiply";

/* KP Plus key pressed */
"KP Plus" = "KP Plus";

/* L key pressed */
"L" = "L";

/* Device footer view for BT-105 indicating last key pressed */
"Last key pressed: %@" = "Last key pressed: %@";

/* Left Bracket key pressed */
"Left Bracket" = "Left Bracket";

/* Text to display before mode switch info webpage has loaded */
"Loading..." = "Loading...";

/* Low power setting cell */
"Low power mode" = "Low power mode";

/* M key pressed */
"M" = "M";

/* AirTurn max number of AirTurns */
"Max number of AirTurns" = "Max number of AirTurns";

/* Minus key pressed */
"Minus" = "Minus";

/* Mode switch info title */
"Mode help" = "Mode help";

/* Model not supported error title */
"Model not supported!" = "Model not supported!";

/* Update more information button */
"More info" = "More info";

/* N key pressed */
"N" = "N";

/* Time interval before automatic power off - never */
"Never" = "Never";

/* No debounce value label */
"No debounce" = "No debounce";

/* No update cell text */
"No Update" = "No Update";

/* Update available not now dismiss button */
"Not now" = "Not now";

/* O key pressed */
"O" = "O";

/* OK
   OK button title */
"OK" = "OK";

/* Open method setting cell */
"Open method" = "Open method";

/* OS key repeat setting cell */
"OS key repeat" = "OS key repeat";

/* Data too large peripheral update error message */
"OTA update data was too large" = "OTA update data was too large";

/* P key pressed */
"P" = "P";

/* Page down key pressed */
"Page Down" = "Page Down";

/* Page Up key pressed */
"Page Up" = "Page Up";

/* Pairing method section heading */
"Pairing Method" = "Pairing Method";

/* Switch to closed when not paired warning title */
"Pairing required" = "Pairing required";

/* AirTurn pre-connect pairing warning title */
"Pairing Required" = "Pairing Required";

/* PED key repeat setting cell */
"PED key repeat" = "PED key repeat";

/* Performing update context */
"performing update" = "performing update";

/* Performing update label */
"Performing update" = "Performing update";

/* Period key pressed */
"Period" = "Period";

/* Port config table view cell */
"Port Configuration" = "Port Configuration";

/* No comment provided by engineer. */
"Power off when idle" = "Power off when idle";

/* Problem connecting error title */
"Problem connecting" = "Problem connecting";

/* Q key pressed */
"Q" = "Q";

/* Quote key pressed */
"Quote" = "Quote";

/* R key pressed */
"R" = "R";

/* Button to initiate reconnection */
"Reconnect" = "Reconnect";

/* Reconnection timeout peripheral update error message */
"Reconnection timed out after performing the update. Try toggling Bluetooth off and on, either from control centre (swipe up from the bottom of your screen) or iOS settings, and if that doesn't work, try reinserting the battery in your device" = "Reconnection timed out after performing the update. Try toggling Bluetooth off and on, either from control centre (swipe up from the bottom of your screen) or iOS settings, and if that doesn't work, try reinserting the battery in your device";

/* No comment provided by engineer. */
"Repeat rate" = "Repeat rate";

/* No comment provided by engineer. */
"Reset changes" = "Reset changes";

/* No comment provided by engineer. */
"Reset to default" = "Reset to default";

/* Return key pressed */
"Return" = "Return";

/* Right Bracket key pressed */
"Right Bracket" = "Right Bracket";

/* S key pressed */
"S" = "S";

/* No comment provided by engineer. */
"Save to AirTurn" = "Save to AirTurn";

/* Text to display in the placeholder for the list of devices when none have been found */
"Scanning..." = "Scanning...";

/* Semicolon key pressed */
"Semicolon" = "Semicolon";

/* Programming section header */
"Settings" = "Settings";

/* Slash key pressed */
"Slash" = "Slash";

/* Space key pressed */
"Space" = "Space";

/* Closed method alert message plural */
"Switching to Closed method will delete %d other pairings the AirTurn has with other devices. %@Are you sure you want to do this?" = "Switching to Closed method will delete %1$d other pairings the AirTurn has with other devices. %2$@Are you sure you want to do this?";

/* Closed method alert message singular */
"Switching to Closed method will delete one other pairing the AirTurn has stored. %@Are you sure you want to do this?" = "Switching to Closed method will delete one other pairing the AirTurn has stored. %@Are you sure you want to do this?";

/* T key pressed */
"T" = "T";

/* Tab key pressed */
"Tab" = "Tab";

/* Invalid state peripheral error message */
"The AirTurn is in an invalid state to perform this action" = "The AirTurn is in an invalid state to perform this action";

/* Battery low peripheral update error message */
"The battery is too low to perform an update. Replace or charge the battery and try again" = "The battery is too low to perform an update. Replace or charge the battery and try again";

/* Disconnected central error message
   Disconnected peripheral error message */
"The device disconnected while performing the action" = "The device disconnected while performing the action";

/* Disconnected peripheral update error message */
"The device disconnected while the update was being performed. Reconnect and try again" = "The device disconnected while the update was being performed. Reconnect and try again";

/* Not paired central error message
   Not paired peripheral error message */
"The device failed to pair. Try again, or forget the device in iOS Settings > Bluetooth" = "The device failed to pair. Try again, or forget the device in iOS Settings > Bluetooth";

/* Not connected central error message
   Not connected peripheral error message */
"The device is not connected" = "The device is not connected";

/* Not ready central error message
   Not ready peripheral update error message */
"The device is not ready" = "The device is not ready";

/* Hash fail peripheral update error message */
"The firmware was corrupted while being sent to your device. Don't worry! The update was cancelled. Your device will now restart, reconnect and then try again" = "The firmware was corrupted while being sent to your device. Don't worry! The update was cancelled. Your device will now restart, reconnect and then try again";

/* Model not supported error message */
"The model of device connected is not supported by this App. Try updating the App and reconnecting" = "The model of device connected is not supported by this App. Try updating the App and reconnecting";

/* Operation cancelled peripheral error message */
"The operation was cancelled" = "The operation was cancelled";

/* Version not matching peripheral update error message */
"The update failed: the version was not the version expected after OTA" = "The update failed: the version was not the version expected after OTA";

/* Update complete alert message */
"The update has been sent to your device which is now restarting. %@%@" = "The update has been sent to your device which is now restarting. %1$@%2$@";

/* Problem connecting error message */
"There was a problem connecting to %@. This usually happens if you reset your AirTurn to delete the pairing without resetting the pairing in iOS, or have just updated the firmware. To delete the pairing, go in to iOS settings > Bluetooth > %1$@ (tap (i)) > Forget This Device, toggle Bluetooth off and on, then try connecting again in this App by tapping the alert icon next to the AirTurn and then 'Reconnect'" = "There was a problem connecting to %@. This usually happens if you reset your AirTurn to delete the pairing without resetting the pairing in iOS, or have just updated the firmware. To delete the pairing, go in to iOS settings > Bluetooth > %1$@ (tap (i)) > Forget This Device, toggle Bluetooth off and on, then try connecting again in this App by tapping the alert icon next to the AirTurn and then 'Reconnect'";

/* Unsupported feature peripheral error message */
"This action is unsupported on this device" = "This action is unsupported on this device";

/* AirTurn already bonded message */
"This AirTurn is already paired to another device. Reset the AirTurn by holding power for 6s until it flashes to indicate it has reset, then try again" = "This AirTurn is already paired to another device. Reset the AirTurn by holding power for 6s until it flashes to indicate it has reset, then try again";

/* Connecting timed out peripheral error message */
"Timed out" = "Timed out";

/* U key pressed */
"U" = "U";

/* Unexpected unresolvable central error message
   Unexpected unresolvable peripheral error message */
"Unexpected error which can't be resolved" = "Unexpected error which can't be resolved";

/* Unhandled central error message
   Unhandled peripheral error message */
"Unhandled error" = "Unhandled error";

/* Unknown key pressed */
"Unknown" = "Unknown";

/* Unknown peripheral update error message */
"Unknown error" = "Unknown error";

/* Unknown error title */
"Unknown error!" = "Unknown error!";

/* Debug update confirm message */
"UNLESS YOU ARE AIRTURN STAFF AND KNOW WHAT YOU ARE DOING, CANCEL NOW, THIS WILL BRICK YOUR DEVICE" = "UNLESS YOU ARE AIRTURN STAFF AND KNOW WHAT YOU ARE DOING, CANCEL NOW, THIS WILL BRICK YOUR DEVICE";

/* Update section header */
"Update" = "Update";

/* Update available alert title */
"Update available" = "Update available";

/* Update complete alert title
   Update complete label */
"Update complete" = "Update complete";

/* Update error title */
"Update error" = "Update error";

/* Update not supported error title */
"Update not supported" = "Update not supported";

/* V key pressed */
"V" = "V";

/* W key pressed */
"W" = "W";

/* Bluetooth toggle required message */
"Waiting for Bluetooth off + on" = "Waiting for Bluetooth off + on";

/* Waiting for reconnection message */
"Waiting for reconnection" = "Waiting for reconnection";

/* Beta update confirm message */
"WARNING: This will check for beta updates which should only be done if instructed by AirTurn Support. Please cancel now otherwise" = "WARNING: This will check for beta updates which should only be done if instructed by AirTurn Support. Please cancel now otherwise";

/* Mode switch footer 'link' text */
"Which mode should I use?" = "Which mode should I use?";

/* Writing connection configuration context */
"writing connection configuration" = "writing connection configuration";

/* Writing debounce time context */
"writing debounce time" = "writing debounce time";

/* Writing delay before repeat context */
"writing delay before repeat" = "writing delay before repeat";

/* Writing idle power off context */
"writing idle power off" = "writing idle power off";

/* Writing pairing method context */
"writing pairing method" = "writing pairing method";

/* Writing port configuration context */
"writing port configuration" = "writing port configuration";

/* Writing repeat rate context */
"writing repeat rate" = "writing repeat rate";

/* X key pressed */
"X" = "X";

/* Y key pressed */
"Y" = "Y";

/* AirTurn max number of AirTurns message */
"You can only connect %d AirTurn(s) at once. To connect to this AirTurn, forget another AirTurn first" = "You can only connect %d AirTurn(s) at once. To connect to this AirTurn, forget another AirTurn first";

/* Will pair warning if not paired and switching to closed */
"You will also be prompted to pair after saving this setting. " = "You will also be prompted to pair after saving this setting. ";

/* Info for removing pairing */
"You will need to remove the pairing in iOS settings > Bluetooth > %@ (tap (i)) > Forget This Device, and then reconnect" = "You will need to remove the pairing in iOS settings > Bluetooth > %@ (tap (i)) > Forget This Device, and then reconnect";

/* Z key pressed */
"Z" = "Z";

/* Left Arrow key pressed */
"←" = "←";

/* Up Arrow key pressed */
"↑" = "↑";

/* Right Arrow key pressed */
"→" = "→";

/* Down Arrow key pressed */
"↓" = "↓";

